## 5. Pandas 자료 구조 소개

In [76]:
from pandas import Series, DataFrame

In [77]:
import pandas as pd

### 1) Series

In [78]:
obj = Series([4,7,-5,3])

In [79]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [80]:
obj.values

array([ 4,  7, -5,  3])

In [81]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [82]:
obj2 = Series([4,7,-5,3], index=['d', 'b', 'a', 'c'])

In [83]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [84]:
obj2.index   #type은 object

Index([u'd', u'b', u'a', u'c'], dtype='object')

- 배열에서 값을선택하거나 대입할 때는 색인을 이용해서 접근이 가능

In [85]:
obj2['a']

-5

In [86]:
obj2['d'] = 6

In [87]:
obj2[['c', 'a', 'd']]   #다음과 같은색인 검색이 가능, c, a, d를 넣으면 다음과 같이 출력이 가능

c    3
a   -5
d    6
dtype: int64

In [88]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [89]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [90]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [91]:
import numpy as np

In [92]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

- 다양한 표현도 가능

In [93]:
'b' in obj2

True

In [94]:
'e' in obj2   #obj2에 b, e가 있으면 True, 없으면 False

False

- 파이썬 사전형에 데이터를 저장해야 한다면 다음과 같이 바꿀 수 있다.

In [95]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [96]:
obj3 = Series(sdata)

In [97]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

- 사전 객체만 가지고 Series 객체를 생성하면 생성된 Series 객체의 색인은 사전의 키 값이 순서대로 들어간다

In [98]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [99]:
obj4 = Series(sdata, index=states)   #obj4에 sdata값을 넣고, 색인 검색으로 state에 있는 값을 찾도록 한다.

In [100]:
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [101]:
pd.isnull(obj4)   #null이면 True

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [102]:
pd.notnull(obj4)   #null이면 False

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [103]:
obj4.isnull()   #Series는 인스턴스 메서드

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [104]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [105]:
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [106]:
obj3 + obj4   #다음과 같은 연산이 가능

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

- name속성이 있는데, 이 속성은 pandas의 기능에서 중요한 부분을 차지

In [107]:
obj4.name = 'population'

In [108]:
obj4.index.name = 'state'

In [109]:
obj4

state
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [110]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [111]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 2) DataFrame

In [112]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [113]:
frame   #위의 데이터를 다음과 같이 DataFrame으로 만듬

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [114]:
DataFrame(data, columns=['year', 'state', 'pop'])   #다음과 같이 배치가 가능

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [115]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                  index=['one', 'two', 'three', 'four', 'five'])

In [116]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [117]:
frame2.columns   #column에 대한 정보가 나온다.

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [118]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [119]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [120]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [121]:
frame2['debt'] = 16.5

In [122]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [123]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [124]:
frame2['debt'] = np.arange(5.)

In [125]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [126]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [127]:
frame2['debt'] = val   #val에 다음과 같이 시리즈를 만든후 frame2에 debt에 인덱스에 위치한 곳에 다음의 값들을 대입

In [128]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [129]:
frame2['eastern'] = frame2.state == 'Ohio'

In [130]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [131]:
del frame2['eastern']   #del이라는 예약어를 통해서 column삭제

In [132]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [133]:
pop = {'Nevada': {2001:2.4, 2002:2.9}, 'Ohio': {2000:1.5, 2001:1.7, 2002:3.6}}

In [134]:
frame3 = DataFrame(pop)

In [135]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [136]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [137]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [138]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [139]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [140]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [141]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [142]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [143]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [144]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

### 3)색인 객체

In [145]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [146]:
index = obj.index

In [147]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [148]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [149]:
index[1] = 'd'   #색인 객체는 변경이 불가능

TypeError: Indexes does not support mutable operations

In [150]:
index = pd.Index(np.arange(3))

In [151]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [152]:
index

Int64Index([0, 1, 2], dtype='int64')

In [153]:
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [154]:
obj2.index is index   #obj2.index의 값과 index의 값이 같은지 비교

True

In [155]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [156]:
'Ohio' in frame3.columns

True

In [157]:
2003 in frame3.index

False

## 2. 핵심 기능

### 1) 재색인

In [158]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [159]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [160]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [161]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [162]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)   #비어있는경우 0으로 채움

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [163]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0,2,4])

In [164]:
obj3.reindex(range(6), method='ffill')   #method의 ffill값을 사용하면 누락된 값을 다음과 같이 채울 수 있다.

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

- DataFrame에 대한 reindex는 색인, 칼럼 또는 둘 다 변경이 가능하다. 그냥 순서만 전달하면 로우가 재색인 됨

In [166]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [167]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [168]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [170]:
frame2   #인덱스가 추가 되어도 재 색인 됨.

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

- Coloumns 예약어를 사용해서 재색인 할 수 있다.

In [171]:
states = ['Texas', 'Utah', 'California']

In [172]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

- 로우와 칼럼을 모두 한번에 재색인 할 수있지만, 보간은 로우에 대해서만 이루어 진다.(axis 0)

In [178]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

- 재색인은 ix를 이용해서 라벨로 색인하면 좀 더 간단하게 해결 가능

In [179]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

### 2) 하나의 로우 또는 칼럼 삭제하기

In [180]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [181]:
new_obj = obj.drop('c')

In [182]:
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [184]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: float64

- DataFrame에서는 로우와 칼럼 모두에서 값을 삭제할 수 있다.

In [185]:
data = DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [186]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [187]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [188]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### 3) 색인하기, 선택하기, 자르기

In [189]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [190]:
obj['b']

1.0

In [191]:
obj[1]

1.0

In [192]:
obj[2:4]

c    2
d    3
dtype: float64

In [193]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: float64

In [194]:
obj[[1,3]]

b    1
d    3
dtype: float64

In [195]:
obj[obj<2]

a    0
b    1
dtype: float64

In [196]:
obj['b':'c']

b    1
c    2
dtype: float64

In [197]:
obj['b':'c'] = 5

In [198]:
obj

a    0
b    5
c    5
d    3
dtype: float64

- DataFrame에서 칼럼의 값을 하나 이상 가져올 수 있다.

In [199]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [200]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [201]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [202]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [203]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [204]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [205]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [206]:
data[data<5] = 0

In [207]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [208]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [209]:
data.ix[['Colorado', 'Utah'], [3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [210]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [211]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [213]:
data.ix[data.three>5, :3]   #칼럼의 three의 값에서 5보다 큰 index중에서 컬럼 3번째 까지만 출력 되도록

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### 4) 산술연산과 데이터 정렬

In [215]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a','c','d','e'])

In [216]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a','c','e','f', 'g'])

In [218]:
s1 + s2   #겹치는 색인이 없는 경우에는 다음과 같이 NA로 표시 된다.

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [219]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [220]:
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [221]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [222]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [223]:
df1 + df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

**산술연산 메서드에 채워 넣을 값 지정하기**

In [224]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [225]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [226]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [229]:
df1 + df2   #겹치지 않는 부분의 값은 NaN

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [231]:
df1.add(df2, fill_value=0)   #df1에 df2의 값을 채워 넣으며, 같이 가지고 있는 값의 경우에는 덧셈을 수행

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [233]:
df1.reindex(columns=df2.columns, fill_value=0)   #df1의 인덱스에 column은 df2의 칼럼으로 채우기

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

### DataFrame과 Series 간의 연산

In [234]:
arr = np.arange(12.).reshape((3,4))

In [235]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [236]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [237]:
arr - arr[0]   #arr의 각 행마다 arr[0]의 값만큼 빼준다.

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [238]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [239]:
series = frame.ix[0]

In [240]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [243]:
series   #series에 Utah인덱스의 값들이 들어간다.

b    0
d    1
e    2
Name: Utah, dtype: float64

In [244]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

- 재색인도 가능

In [245]:
series2 = Series(range(3), index=['b', 'e', 'f'])   #d의 컬럼의 값들은 나오지 않는것을 볼 수 있다.

In [246]:
frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [247]:
series3 = frame['d']

In [248]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [250]:
series3   #frame의 'd'칼럼만 들어있음

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [251]:
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

### 5) 함수 적용과 매핑

In [252]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [253]:
frame

               b         d         e
Utah   -1.122857  0.358371  0.125622
Ohio   -0.175752 -0.141204 -0.946044
Texas  -0.762050 -1.341581 -0.045666
Oregon  0.572648 -0.798411 -1.129367

In [256]:
np.abs(frame)   #절대값을 취한 데이터프레임값이 출력

               b         d         e
Utah    1.122857  0.358371  0.125622
Ohio    0.175752  0.141204  0.946044
Texas   0.762050  1.341581  0.045666
Oregon  0.572648  0.798411  1.129367

- 자주 사용되는 또 다른 연산은 각 로우나 칼럼의 1차원 배열에 함수를 적용하는것. apply()함수를 사용

- 배열의 합계, 평균 같은 일반적인 통계는 DataFrame의 메서드로 있으므로 apply() 메소드를 사용해야만 하는 것은 아니다.

In [257]:
f = lambda x: x.max() - x.min()

In [258]:
frame.apply(f)   #b의 칼럼 값에서 가장 큰 값과 가장 작은 값의 차를 나타냄

b    1.695506
d    1.699951
e    1.254989
dtype: float64

In [259]:
frame.apply(f, axis=1)   #각 인덱스의 칼럼 값에서 가장 큰 값과 가장 작은 값의 차를 나타냄

Utah      1.481228
Ohio      0.804840
Texas     1.295914
Oregon    1.702015
dtype: float64

In [260]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [261]:
frame.apply(f)   #위아 같이 min과 max로 인덱싱 후에 각 칼럼에서의 최대, 최소값을 구함

            b         d         e
min -1.122857 -1.341581 -1.129367
max  0.572648  0.358371  0.125622

- applymap함수를 사용 함

In [262]:
format = lambda x: '%.2f' % x

In [263]:
frame.applymap(format)

            b      d      e
Utah    -1.12   0.36   0.13
Ohio    -0.18  -0.14  -0.95
Texas   -0.76  -1.34  -0.05
Oregon   0.57  -0.80  -1.13

In [264]:
frame['e'].map(format)

Utah       0.13
Ohio      -0.95
Texas     -0.05
Oregon    -1.13
Name: e, dtype: object

### 6) 정렬과 순위

In [265]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [267]:
obj.sort_index()   #sort_index 메소드를 사용하면 알파벳 순으로 정렬 가능

a    1
b    2
c    3
d    0
dtype: int64

- 로우나 칼럼 중 하나의 축을 기준으로 정렬 가능

In [268]:
frame = DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], columns=['d','a','b','c'])

In [269]:
frame.sort_index()   #로우 정렬

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [270]:
frame.sort_index(axis=1)   #축이 1이므로 칼럼을 정렬

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

- 값에 따라 정렬하는 경우에는 order메서드를 사용

In [271]:
obj = Series([4,7,-3, 2])

In [273]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [272]:
obj.order()

2   -3
3    2
0    4
1    7
dtype: int64

- Series객체에서 비어있는 값은 기본적으로 가장 마지막에 위치하도록 정렬한다.

In [274]:
obj = Series([4,np.nan, 7,np.nan,-3, 2])

In [275]:
obj.order()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

- DataFrame에서는 하나 이상의 칼럼에 있는 값으로 정렬이 필요
- by 옵션에 필요한 칼럼의 이름을 남김

In [276]:
frame = DataFrame({'b': [4,7,-3,2], 'a':[0,1,0,1]})

In [277]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [279]:
frame.sort_index(by='b')   #b 칼럼만 정렬을 하면 다음과 같이 나옴

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [280]:
frame.sort_index(by=['a', 'b'])   #여러 개의 칼럼을 정렬하려면 칼럼의 이름이 담긴 리스트를 전달

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

- 순위는 정렬과 거의 흡사, 1부터 배열의 유효한 데이터 개수까지 순위를 매김
- 순위는 numpy.argsort에서 반환하는 간접 정렬 색인과 유사
- 동률인 순위를 처리하는 방식이 다름
- 동점인 항목에 대해서는 평균 순위를 매김

In [281]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [283]:
obj.rank()   #어떻게 이렇게 나오는지??

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [284]:
obj.rank(method='first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [286]:
obj.rank(ascending=False, method='max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

### 7) 중복 색인

In [287]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [288]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

- is_unique 속성은 해당 값이 유일한지 아닌지 알려준다.

In [289]:
obj.index.is_unique   #인덱스 값들이 중복 된다는것을 알 수 있다.

False

In [290]:
obj['a']

a    0
a    1
dtype: int64

In [291]:
obj['c']

4

In [292]:
df = DataFrame(np.random.randn(4,3), index=['a','a','b','b'])

In [293]:
df

          0         1         2
a -1.073101  0.519821  0.355883
a  0.442147 -0.153018  1.445654
b  0.049392  1.175752 -1.297503
b  0.843570  0.944608 -1.985873

In [295]:
df.ix['b']   #데이터 프레임에서 로우를 선택해서 보는 것도 동일

          0         1         2
b  0.049392  1.175752 -1.297503
b  0.843570  0.944608 -1.985873

## 3. 기술통계 계산과 요약

In [296]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a','b','c','d'], columns=['one','two'])

In [297]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [298]:
df.sum()   #칼럼의 합

one    9.25
two   -5.80
dtype: float64

In [299]:
df.sum(axis=1)   #인덱스 기준의 합

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [301]:
df.mean(axis=1, skipna=False)   #skipna를 이용하여 NA값은 제외시키고 계산

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [305]:
df.idxmax()   #각 칼럼에서 가장 큰 값을 가지고 있는 인덱스를 출력

one    b
two    d
dtype: object

In [306]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [307]:
df.describe()   #한번에 통계 결과를 여러 개 만들어낸다.

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [308]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [310]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [309]:
obj.describe()   #통계가 다음과 같이 나옴

count     16
unique     3
top        a
freq       8
dtype: object

### 1) 상관관계와 공분산

In [314]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)
    
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.iteritems()})

In [315]:
returns = price.pct_change()

In [316]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2015-07-22 -0.042294 -0.000302 -0.016680 -0.036802
2015-07-23 -0.000479 -0.026914  0.008606  0.012516
2015-07-24 -0.005273 -0.032160 -0.012243 -0.003687
2015-07-27 -0.013896  0.005934 -0.004257 -0.012843
2015-07-28  0.004969  0.001180  0.006161 -0.000220

- corr은 메서드는 NA가 아니고 정렬된 색인에서 연속하는 두 Series에 대해 상관관계를 계산
- cov메서드는 공분산을 계산

In [317]:
returns.MSFT.corr(returns.IBM)

0.4951826267525804

In [318]:
returns.MSFT.cov(returns.IBM)

8.3240782420226681e-05

In [319]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.277287  0.381394  0.351797
GOOG  0.277287  1.000000  0.319138  0.375100
IBM   0.381394  0.319138  1.000000  0.495183
MSFT  0.351797  0.375100  0.495183  1.000000

In [320]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000275  0.000061  0.000074  0.000083
GOOG  0.000061  0.000252  0.000058  0.000084
IBM   0.000074  0.000058  0.000138  0.000083
MSFT  0.000083  0.000084  0.000083  0.000204

- corrwith메서드는 다른 Series나 DataFrame과의 상관관계를 계산

In [321]:
returns.corrwith(returns.IBM)

AAPL    0.381394
GOOG    0.319138
IBM     1.000000
MSFT    0.495183
dtype: float64

In [322]:
returns.corrwith(volume)

AAPL   -0.092666
GOOG    0.226701
IBM    -0.183754
MSFT   -0.097645
dtype: float64

### 2) 유일 값, 값 세기, 멤버십

In [323]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [324]:
uniques = obj.unique()

In [325]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [327]:
obj.value_counts()   #도수를 계산

c    3
a    3
b    2
d    1
dtype: int64

In [328]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

- isin메서드는 어떤 값이 Series에 있는지 나타내는 불리언 벡터를 반환
- 칼럼에서 값을 골라내고 싶을 때 유용하게 사용 가능

In [329]:
mask = obj.isin(['b', 'c'])

In [330]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [332]:
obj[mask]   #true값만 출력 되도록

0    c
5    b
6    b
7    c
8    c
dtype: object

In [333]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [335]:
result = data.apply(pd.value_counts).fillna(0)   #비어있는 값은 0으로 채운다.
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

## 4. 누락된 데이터 처리하기

In [336]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [338]:
string_data.isnull()   #null값이 있는경우 true가 출력

0    False
1    False
2     True
3    False
dtype: bool

In [339]:
string_data[0] = None

In [340]:
string_data.isnull()   #NaN과 None값들과 같이 실수든, 누락이든 null과 모두 NA값으로 취급된다.

0     True
1    False
2     True
3    False
dtype: bool

### 1) 누락된 데이터 골라내기

In [341]:
from numpy import nan as NA

In [344]:
data = Series([1, NA, 3.5, NA, 7])
data.dropna()   #NA의 값은 제외

0    1.0
2    3.5
4    7.0
dtype: float64

In [346]:
data[data.notnull()]   #NA값이 아닌 값들만 출력 되도록 위와 같은 결과를 갖음

0    1.0
2    3.5
4    7.0
dtype: float64

In [347]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()   #NA의 값들을 drop시킴
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [349]:
cleaned   #NA가 없는 인덱스의 값만 출력되게 된다.

   0    1  2
0  1  6.5  3

In [351]:
data.dropna(how='all')   #인덱스에 해당하는 칼럼의 값들이 모두 NA인 경우만 제외하고 출력 하도록

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [353]:
data[4] = NA
data   #새로운 칼럼을 추가

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [355]:
data.dropna(axis=1, how='all')   #칼럼을 축으로, NA인 경우 제외시키고 출력되도록

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [356]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0  0.833422       NaN       NaN
1  0.000499       NaN       NaN
2 -1.573418       NaN       NaN
3 -0.805062       NaN  0.715176
4  1.456606       NaN -0.763459
5 -0.188040 -0.718948 -2.953361
6 -0.248404  2.732638  1.212794

In [358]:
df.dropna(thresh=3)   #몇개 이상의 값이 들어있는 인덱스만 살펴보고 싶은 경우 thresh에 값을 적용하면 된다.

          0         1         2
5 -0.188040 -0.718948 -2.953361
6 -0.248404  2.732638  1.212794

### 2) 누락된 값 채우기

In [359]:
df.fillna(0)

          0         1         2
0  0.833422  0.000000  0.000000
1  0.000499  0.000000  0.000000
2 -1.573418  0.000000  0.000000
3 -0.805062  0.000000  0.715176
4  1.456606  0.000000 -0.763459
5 -0.188040 -0.718948 -2.953361
6 -0.248404  2.732638  1.212794

In [361]:
df.fillna({1: 0.5, 3: -1})   #1번 칼럼에서 NA는 0.5로 채우고, 3번 칼럼의 경우에는 NaN으로 한다.

          0         1         2
0  0.833422  0.500000       NaN
1  0.000499  0.500000       NaN
2 -1.573418  0.500000       NaN
3 -0.805062  0.500000  0.715176
4  1.456606  0.500000 -0.763459
5 -0.188040 -0.718948 -2.953361
6 -0.248404  2.732638  1.212794

In [362]:
#fillna는 값을 채워 넣은 객체의 참조를 반환한다.
_ = df.fillna(0, inplace = True)
df

          0         1         2
0  0.833422  0.000000  0.000000
1  0.000499  0.000000  0.000000
2 -1.573418  0.000000  0.000000
3 -0.805062  0.000000  0.715176
4  1.456606  0.000000 -0.763459
5 -0.188040 -0.718948 -2.953361
6 -0.248404  2.732638  1.212794

In [363]:
df = DataFrame(np.random.randn(6,3))

In [364]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA   #인덱스 2부터 1번 칼럼에 NA를 넣고, 인덱스 4부터 2번 칼럼에 NA를 넣는다

In [365]:
df

          0         1         2
0  0.223863 -0.030594 -0.980556
1  0.625663  0.205214  0.294257
2  1.400409       NaN  0.517182
3 -0.102480       NaN  0.844858
4 -0.426016       NaN       NaN
5 -0.342911       NaN       NaN

In [366]:
df.fillna(method='ffill')

          0         1         2
0  0.223863 -0.030594 -0.980556
1  0.625663  0.205214  0.294257
2  1.400409  0.205214  0.517182
3 -0.102480  0.205214  0.844858
4 -0.426016  0.205214  0.844858
5 -0.342911  0.205214  0.844858

In [368]:
df.fillna(method='ffill', limit=2)   #limit를 두어서 위의 값을 가져오되, 2번까지만 가져오도록 한다.

          0         1         2
0  0.223863 -0.030594 -0.980556
1  0.625663  0.205214  0.294257
2  1.400409  0.205214  0.517182
3 -0.102480  0.205214  0.844858
4 -0.426016       NaN  0.844858
5 -0.342911       NaN  0.844858

In [369]:
data = Series([1., NA, 3.5, NA, 7])

In [371]:
data.fillna(data.mean())   #빈 공간을 바로 위의 값으로 채우면서, 각 인덱싱의 평균값을 구함

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 5. 계층적 색인

- 계층적 색인은 pandas의 중요한 기능
- 축에 대해 다중 색인 단계를 지정할 수 있도록 해준다.

In [372]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -0.104324
   2   -1.925584
   3   -1.026046
b  1   -0.925487
   2    0.903981
   3   -1.509898
c  1    1.129553
   2    1.916166
d  2   -0.405995
   3    0.223241
dtype: float64

- MultiIndex를 색인으로 하는 Series로, 색인의 계층을 보여주고 있다.

In [373]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [374]:
data['b']

1   -0.925487
2    0.903981
3   -1.509898
dtype: float64

In [375]:
data['b':'c']

b  1   -0.925487
   2    0.903981
   3   -1.509898
c  1    1.129553
   2    1.916166
dtype: float64

In [376]:
data.ix[['b', 'd']]

b  1   -0.925487
   2    0.903981
   3   -1.509898
d  2   -0.405995
   3    0.223241
dtype: float64

In [377]:
data[:, 2]

a   -1.925584
b    0.903981
c    1.916166
d   -0.405995
dtype: float64

- unstack 메서드를 사용해서 데이터를 새롭게 배열이 가능

In [378]:
data.unstack()

          1         2         3
a -0.104324 -1.925584 -1.026046
b -0.925487  0.903981 -1.509898
c  1.129553  1.916166       NaN
d       NaN -0.405995  0.223241

In [380]:
data.unstack().stack()   #unstack에 반대되는 stack 메서드를 수행

a  1   -0.104324
   2   -1.925584
   3   -1.026046
b  1   -0.925487
   2    0.903981
   3   -1.509898
c  1    1.129553
   2    1.916166
d  2   -0.405995
   3    0.223241
dtype: float64

In [381]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [383]:
frame.index.names = ['key1', 'key2']        #각 인덱스를 key1, key2로 나눔
frame.columns.names = ['state', 'color']    #각 칼럼을 다음과 같이 state와 color로 나눔
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [384]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### 1) 계층 순서 바꾸고 정렬하기기

In [386]:
frame.swaplevel('key1', 'key2')   #key의 순서를 바꿈

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [389]:
frame.sortlevel(1)   #sortlevel 메서드를 사용하여 사전식 정렬을 하도록 한다.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [394]:
frame.swaplevel(0,1).sortlevel(0)   #key2를 정렬, key1을 다시 사전식으로 정렬

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### 2) 단계별 요약통계

In [396]:
frame.sum(level='key2')   #key2의 값 별로 합을 구함

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [398]:
frame.sum(level='color', axis=1)   #color에 따라 합을 구함

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 3) DataFrame의 칼럼 사용하기

In [399]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [404]:
frame2 = frame.set_index(['c', 'd'])   #'c'와 'd'를 인덱스로 하여 재색인
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [409]:
frame.set_index(['c', 'd'], drop=False)   #drop을 써줌으로써 c와 d 칼럼이 나타나는 것을 알 수 있다.

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [411]:
frame2.reset_index()   #reset_index는 set_index와 반대되는 개념으로, 계층적 색인 단계가 칼럼으로 이동

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 6. pandas와 관련된 기타 주제

## 1) 정수 색인

In [412]:
ser = Series(np.arange(3.))

In [414]:
ser

0    0
1    1
2    2
dtype: float64

In [416]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])

In [417]:
ser2[-1]

2.0

In [418]:
ser2

a    0
b    1
c    2
dtype: float64

In [419]:
ser.ix[:1]

0    0
1    1
dtype: float64

In [426]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3

-5    0
 1    1
 3    2
dtype: int64

In [427]:
ser3.iget_value(2)   #해당 번째의 값을 불러온다.

2

In [431]:
ser.iget_value(0)

0.0

In [428]:
frame = DataFrame(np.arange(6).reshape((3,2)), index=[2,0,1])
frame

   0  1
2  0  1
0  2  3
1  4  5

In [433]:
frame.irow(0)   #0번째 인덱스의 칼럼 값들을 불러온다.

0    0
1    1
Name: 2, dtype: int64

In [435]:
frame.icol(1)

2    1
0    3
1    5
Name: 1, dtype: int64

### 2) Panel 데이터

In [436]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [437]:
pdata   #pdata의 정보

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1421 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2015-07-28 00:00:00
Minor_axis axis: Open to Adj Close

In [438]:
pdata = pdata.swapaxes('items', 'minor')

In [440]:
pdata['Adj Close']   #야후에서 받아오는 주식 데이터

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   28.718094  14.06528         NaN  26.769336
2010-01-05   28.767737  14.38450         NaN  26.777984
2010-01-06   28.310151  14.10397         NaN  26.613650
2010-01-07   28.257821  14.23940         NaN  26.336875
2010-01-08   28.445687  14.36516         NaN  26.518508
2010-01-11   28.194745  14.37483         NaN  26.181189
2010-01-12   27.874037  14.56830         NaN  26.008204
2010-01-13   28.267213  14.57797         NaN  26.250383
2010-01-14   28.103497  14.22005         NaN  26.777984
2010-01-15   27.633830  13.92985         NaN  26.691493
2010-01-19   28.856306  14.32646         NaN  26.899074
2010-01-20   28.412135  14.03626         NaN  26.457964
2010-01-21   27.921004  13.92017         NaN  25.956309
2010-01-22   26.536154  13.18982         NaN  25.048140
2010-01-25   27.250048  13.43650         NaN  25.359512
2010-01-26   27.635174  13.13662         NaN  25.515199
2010-01-27   27.895500  13.08825         NaN  25.662235
2010-01-28   26.742807  12.84641         NaN  25.221125
2010-01-29   25.772608  12.47882         NaN  24.373502
2010-02-01   26.130897  12.78837         NaN  24.572434
2010-02-02   26.282534  12.86576         NaN  24.615679
2010-02-03   26.734757  12.92380         NaN  24.762716
2010-02-04   25.771266  12.58523         NaN  24.079428
2010-02-05   26.228860  12.80772         NaN  24.235114
2010-02-08   26.049045  12.95282         NaN  23.975637
2010-02-09   26.326814  13.10760         NaN  24.226465
2010-02-10   26.183238  13.30107         NaN  24.209166
2010-02-11   26.659611  13.49454         NaN  24.321607
2010-02-12   26.889071  13.38813         NaN  24.157271
2010-02-16   27.294328  13.67834         NaN  24.635203
...                ...       ...         ...        ...
2015-06-16  127.599998       NaN  528.150024  45.830002
2015-06-17  127.300003       NaN  529.260010  45.970001
2015-06-18  127.879997       NaN  536.729980  46.720001
2015-06-19  126.599998       NaN  536.690002  46.099998
2015-06-22  127.610001       NaN  538.190002  46.230000
2015-06-23  127.029999       NaN  540.479980  45.910000
2015-06-24  128.110001       NaN  537.840027  45.639999
2015-06-25  127.500000       NaN  535.229980  45.650002
2015-06-26  126.750000       NaN  531.690002  45.259998
2015-06-29  124.529999       NaN  521.520020  44.369999
2015-06-30  125.430000       NaN  520.510010  44.150002
2015-07-01  126.599998       NaN  521.840027  44.450001
2015-07-02  126.440002       NaN  523.400024  44.400002
2015-07-06  126.000000       NaN  522.859985  44.389999
2015-07-07  125.690002       NaN  525.020020  44.299999
2015-07-08  122.570000       NaN  516.830017  44.240002
2015-07-09  120.070000       NaN  520.679993  44.520000
2015-07-10  123.279999       NaN  530.130005  44.610001
2015-07-13  125.660004       NaN  546.549988  45.540001
2015-07-14  125.610001       NaN  561.099976  45.619999
2015-07-15  126.820000       NaN  560.219971  45.759998
2015-07-16  128.509995       NaN  579.849976  46.660000
2015-07-17  129.619995       NaN  672.929993  46.619999
2015-07-20  132.070007       NaN  663.020020  46.919998
2015-07-21  130.750000       NaN  662.299988  47.279999
2015-07-22  125.220001       NaN  662.099976  45.540001
2015-07-23  125.160004       NaN  644.280029  46.110001
2015-07-24  124.500000       NaN  623.559998  45.939999
2015-07-27  122.769997       NaN  627.260010  45.349998
2015-07-28  123.379997       NaN  628.000000  45.340000

[1421 rows x 4 columns]

In [442]:
pdata.ix[:, '6/1/2012', :]   #날짜를 지정하여 받아오기

            Open        High         Low       Close     Volume  Adj Close
AAPL  569.159996  572.649956  560.520012  560.990036  130246900  75.279486
DELL   12.150000   12.300000   12.045000   12.070000   19397600  11.675920
GOOG         NaN         NaN         NaN         NaN        NaN        NaN
MSFT   28.760000   28.959999   28.440001   28.450001   56634300  26.126961

In [444]:
pdata.ix['Adj Close', '5/22/2012':, :]   #2012년 5월 22일 부터 자료들 다 받아오기

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   74.740031  14.58765         NaN  27.329995
2012-05-23   76.563680  12.08221         NaN  26.733070
2012-05-24   75.860527  12.04351         NaN  26.696335
2012-05-25   75.453926  12.05319         NaN  26.687151
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   76.793152  12.24666         NaN  27.146325
2012-05-30   77.719062  12.14992         NaN  26.944289
2012-05-31   77.525831  11.92743         NaN  26.806537
2012-06-01   75.279486  11.67592         NaN  26.126961
2012-06-04   75.722313  11.60821         NaN  26.218794
2012-06-05   75.526394  11.76298         NaN  26.182061
2012-06-06   76.684450  11.81619         NaN  26.953473
2012-06-07   76.719351  11.73396         NaN  26.843270
2012-06-08   77.873386  11.72429         NaN  27.228976
2012-06-11   76.645536  11.47278         NaN  26.540216
2012-06-12   77.315149  11.57919         NaN  26.898372
2012-06-13   76.778382  11.87423         NaN  26.751435
2012-06-14   76.693845  11.93711         NaN  26.944289
2012-06-15   77.042741  11.89841         NaN  27.568765
2012-06-18   78.606065  12.01449         NaN  27.403462
2012-06-19   78.824788  11.78233         NaN  28.193241
2012-06-20   78.600690  11.89841         NaN  28.404460
2012-06-21   77.517783  11.60821         NaN  27.678965
2012-06-22   78.112240  11.80168         NaN  28.193241
2012-06-25   76.591858  11.55500         NaN  27.431013
2012-06-26   76.760939  11.53565         NaN  27.568765
2012-06-27   77.092391  11.92743         NaN  27.706517
2012-06-28   76.361060  11.55984         NaN  27.467746
2012-06-29   78.367204  12.10155         NaN  28.092222
2012-07-02   79.510504  11.98064         NaN  28.064671
...                ...       ...         ...        ...
2015-06-16  127.599998       NaN  528.150024  45.830002
2015-06-17  127.300003       NaN  529.260010  45.970001
2015-06-18  127.879997       NaN  536.729980  46.720001
2015-06-19  126.599998       NaN  536.690002  46.099998
2015-06-22  127.610001       NaN  538.190002  46.230000
2015-06-23  127.029999       NaN  540.479980  45.910000
2015-06-24  128.110001       NaN  537.840027  45.639999
2015-06-25  127.500000       NaN  535.229980  45.650002
2015-06-26  126.750000       NaN  531.690002  45.259998
2015-06-29  124.529999       NaN  521.520020  44.369999
2015-06-30  125.430000       NaN  520.510010  44.150002
2015-07-01  126.599998       NaN  521.840027  44.450001
2015-07-02  126.440002       NaN  523.400024  44.400002
2015-07-06  126.000000       NaN  522.859985  44.389999
2015-07-07  125.690002       NaN  525.020020  44.299999
2015-07-08  122.570000       NaN  516.830017  44.240002
2015-07-09  120.070000       NaN  520.679993  44.520000
2015-07-10  123.279999       NaN  530.130005  44.610001
2015-07-13  125.660004       NaN  546.549988  45.540001
2015-07-14  125.610001       NaN  561.099976  45.619999
2015-07-15  126.820000       NaN  560.219971  45.759998
2015-07-16  128.509995       NaN  579.849976  46.660000
2015-07-17  129.619995       NaN  672.929993  46.619999
2015-07-20  132.070007       NaN  663.020020  46.919998
2015-07-21  130.750000       NaN  662.299988  47.279999
2015-07-22  125.220001       NaN  662.099976  45.540001
2015-07-23  125.160004       NaN  644.280029  46.110001
2015-07-24  124.500000       NaN  623.559998  45.939999
2015-07-27  122.769997       NaN  627.260010  45.349998
2015-07-28  123.379997       NaN  628.000000  45.340000

[814 rows x 4 columns]

In [446]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()   #DataFrame에 쌓아서 출력 하도록 한다.
stacked

                        Open        High         Low       Close     Volume  \
Date       minor
2012-05-30 AAPL   569.200050  579.989990  566.559990  579.169998  132357400
           DELL    12.590000   12.700000   12.460000   12.560000   19787800
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500
2012-05-31 AAPL   580.740021  581.499985  571.459969  577.730019  122918600
           DELL    12.530000   12.540000   12.330000   12.330000   19955600
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000
2012-06-01 AAPL   569.159996  572.649956  560.520012  560.990036  130246900
           DELL    12.150000   12.300000   12.045000   12.070000   19397600
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.290031  139248900
           DELL    12.110000   12.112500   11.800000   12.000000   17015700
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300
2012-06-05 AAPL   561.269989  566.470055  558.330002  562.830025   97053600
           DELL    11.950000   12.240000   11.950000   12.160000   15620900
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.459969  100363900
           DELL    12.210000   12.280000   12.090000   12.215000   20779900
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720055   94941700
           DELL    12.320000   12.410000   12.120000   12.130000   20074000
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.320038   86879100
           DELL    12.130000   12.225000   12.020000   12.120000   18155600
           MSFT    29.209999   29.680000   29.049999   29.650000   42551100
2012-06-11 AAPL   587.719994  588.499985  570.629990  571.169975  147816200
           DELL    12.150000   12.200000   11.820000   11.860000   16931900
           MSFT    29.730000   29.809999   28.820000   28.900000   46361900
2012-06-12 AAPL   574.459984  576.620033  566.699966  576.159996  108845100
           DELL    11.910000   12.010000   11.680000   11.970000   17608100
           MSFT    29.100000   29.299999   28.840000   29.290001   35337900
...                      ...         ...         ...         ...        ...
2015-07-15 AAPL   125.720001  127.150002  125.580002  126.820000   33463100
           GOOG   560.130005  566.502991  556.789978  560.219971    1776600
           MSFT    45.680000   45.889999   45.430000   45.759998   26482000
2015-07-16 AAPL   127.739998  128.570007  127.349998  128.509995   35866800
           GOOG   565.119995  580.679993  565.000000  579.849976    4053900
           MSFT    46.009998   46.689999   45.970001   46.660000   25894400
2015-07-17 AAPL   129.080002  129.619995  128.309998  129.619995   45693300
           GOOG   649.000000  674.468018  645.000000  672.929993   11134500
           MSFT    46.549999   46.779999   46.259998   46.619999   29262900
2015-07-20 AAPL   130.970001  132.970001  130.699997  132.070007   54159800
           GOOG   659.239990  668.880005  653.010010  663.020020    5848800
           MSFT    46.650002   47.130001   46.439999   46.919998   30271200
2015-07-21 AAPL   132.850006  132.919998  130.320007  130.750000   58898800
           GOOG   655.210022  673.000000  654.299988  662.299988    3348400
           MSFT    46.779999   47.330002   46.480000   47.279999   41205000
2015-07-22 AAPL   121.989998  125.500000  121.989998  125.220001  114692800
           GOOG   660.890015  678.640015  659.000000  662.099976    3689600
           MSFT    45.439999   46.930000   45.200001   45.540001   58724600
2015-07-23 AAPL   126.199997  127.089996  125.059998  125.160004   50688700
           GOOG   661.270020  663.630005  641.000000  644.280029    3001800
           MSFT    45.270000   46.230000   45.099998   46.110001   33465600
2015-07-24 AAPL   125.320000  125.739998  123.900002  124.500000   41051600
           GOOG   647.000000  648.169983  622.520020  623.559998    3608400
           MSFT    45.910000   46.320000   45.799999   45.939999   32077000
2015-07-27 AAPL   123.089996  123.610001  122.120003  122.769997   44274800
           GOOG   621.000000  634.299988  620.500000  627.260010    2668700
           MSFT    45.939999   46.009998   45.250000   45.349998   39189900
2015-07-28 AAPL   123.379997  123.910004  122.550003  123.379997   33448900
           GOOG   632.830017  632.830017  623.309998  628.000000    1704300
           MSFT    45.580002   45.639999   44.790001   45.340000   34177100

                   Adj Close
Date       minor
2012-05-30 AAPL    77.719062
           DELL    12.149920
           MSFT    26.944289
2012-05-31 AAPL    77.525831
           DELL    11.927430
           MSFT    26.806537
2012-06-01 AAPL    75.279486
           DELL    11.675920
           MSFT    26.126961
2012-06-04 AAPL    75.722313
           DELL    11.608210
           MSFT    26.218794
2012-06-05 AAPL    75.526394
           DELL    11.762980
           MSFT    26.182061
2012-06-06 AAPL    76.684450
           DELL    11.816190
           MSFT    26.953473
2012-06-07 AAPL    76.719351
           DELL    11.733960
           MSFT    26.843270
2012-06-08 AAPL    77.873386
           DELL    11.724290
           MSFT    27.228976
2012-06-11 AAPL    76.645536
           DELL    11.472780
           MSFT    26.540216
2012-06-12 AAPL    77.315149
           DELL    11.579190
           MSFT    26.898372
...                      ...
2015-07-15 AAPL   126.820000
           GOOG   560.219971
           MSFT    45.759998
2015-07-16 AAPL   128.509995
           GOOG   579.849976
           MSFT    46.660000
2015-07-17 AAPL   129.619995
           GOOG   672.929993
           MSFT    46.619999
2015-07-20 AAPL   132.070007
           GOOG   663.020020
           MSFT    46.919998
2015-07-21 AAPL   130.750000
           GOOG   662.299988
           MSFT    47.279999
2015-07-22 AAPL   125.220001
           GOOG   662.099976
           MSFT    45.540001
2015-07-23 AAPL   125.160004
           GOOG   644.280029
           MSFT    46.110001
2015-07-24 AAPL   124.500000
           GOOG   623.559998
           MSFT    45.939999
2015-07-27 AAPL   122.769997
           GOOG   627.260010
           MSFT    45.349998
2015-07-28 AAPL   123.379997
           GOOG   628.000000
           MSFT    45.340000

[2297 rows x 6 columns]

In [447]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 808 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2015-07-28 00:00:00
Minor_axis axis: AAPL to MSFT